{
    "Art": "Boundary-pushing contemporary artists, a resurging film industry spearheaded by visionary filmmakers, and an ever-evolving musical soundscape, the art scene of Africa is a vibrant world of self-expression and immense depth. This art section explores the creativity and its creatives reshaping the narratives on the continent one article at a time. In a celebration of diversity across borderlines, we hope to bring to you news of all varieties from cultural festivals and artistic activism to artist profiles to get acquainted with names and faces of the African Art scene.",
    "Black Body & Diaspora": "Black Body & The Diaspora is a space for students to give voice to the tremendous diversity of Africans globally and to honour the solemn histories & ongoing struggles which surround it. Globally, a Western-informed view of Africa tends to portray the continent as an arena of endless chaos & political turmoil—this misinformed view persists because scenes of conflict in Africa are often elevated without the essential historical & modern contexts of Western intervention which motivate them. Here, writers can give voice to communities in African countries who struggle in silence in the face of negligent global media coverage. Writers may celebrate unique intersectional experiences and moments of global unity & solidarity with Africa & across the Black Body. Most importantly, they can shed light on pressing local and global affairs involving African communities at home and abroad, as well as practical ways that the UChicago community can contribute to movements for African liberation & amplify the voices of Africa.",
    "Politics & Economics": "Amidst an ever-changing and increasingly complex landscape, the Politics and Economics section of The Independence carries an important and nuanced journalistic burden. Our primary responsibility is that of general awareness, presenting the facts as we come by them and presenting them honestly to our readers. From everyday occurrences, to paradigm shifting events, from elections to new intracontinental trade deals, we have an obligation to report. But our responsibilities go further. Embodying the Pan-Africanist framework of the larger magazine, this section is especially focused on presenting the image of Africa that breaks free of past, and present, colonial interpretations of the continent. A closer look at the continent will reveal the importance of acknowledging the material relationship between political and economic movement, and decolonization. The Politics and Economics section creates a space for readers to engage with theory and in-depth and evidenced discussions how Africa defines itself everyday.",
    "Science & Technology": "Spotlight Africa by delivering compelling, thought-provoking stories that captivate our diverse and necessary contributions to science and technology. This section produces content that underscores the excellence, advancement, and emerging narratives in the field of science and technology on the African continent. We are particularly interested in articles that feature groundbreaking research, technological innovations, healthcare workers and the individuals driving these achievements. We encourage insightful interviews that bring out the brilliance and determination of African scientists, engineers, and innovators."
}